# ZedBoard xdc
# define clock and period
create_clock -period 12.000 -name clk_pin -waveform {0.000 6.000} [get_ports clk]


# Global timing constraints
set_input_delay -clock clk_pin 0.000      [get_ports rst]
set_input_delay -clock clk_pin -min 1.200 [get_ports rst]
set_input_delay -clock clk_pin 0.000      [get_ports a0]
set_input_delay -clock clk_pin -min 1.200 [get_ports a0]
set_input_delay -clock clk_pin 0.000      [get_ports a1]
set_input_delay -clock clk_pin -min 1.200 [get_ports a1]
set_input_delay -clock clk_pin 0.000      [get_ports a2]
set_input_delay -clock clk_pin -min 1.200 [get_ports a2]
set_input_delay -clock clk_pin 0.000      [get_ports a3]
set_input_delay -clock clk_pin -min 1.200 [get_ports a3]
set_input_delay -clock clk_pin 0.000      [get_ports a4]
set_input_delay -clock clk_pin -min 1.200 [get_ports a4]
set_input_delay -clock clk_pin 0.000      [get_ports a5]
set_input_delay -clock clk_pin -min 1.200 [get_ports a5]
set_input_delay -clock clk_pin 0.000      [get_ports a6]
set_input_delay -clock clk_pin -min 1.200 [get_ports a6]
set_input_delay -clock clk_pin 0.000      [get_ports a7]
set_input_delay -clock clk_pin -min 1.200 [get_ports a7]
#set_output_delay -clock clk_pin 0.000    [all_outputs]
set_output_delay -clock clk_pin 0.000     [all_outputs]
# Path specific timing constraints
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports z0]
set_output_delay -clock clk_pin -min 1.200                   [get_ports z0]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports z1]
set_output_delay -clock clk_pin -min 1.200                   [get_ports z1]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports z2]
set_output_delay -clock clk_pin -min 1.200                   [get_ports z2]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports z3]
set_output_delay -clock clk_pin -min 1.200                   [get_ports z3]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports z4]
set_output_delay -clock clk_pin -min 1.200                   [get_ports z4]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports z5]
set_output_delay -clock clk_pin -min 1.200                   [get_ports z5]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports z6]
set_output_delay -clock clk_pin -min 1.200                   [get_ports z6]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports z7]
set_output_delay -clock clk_pin -min 1.200                   [get_ports z7]