# ZedBoard xdc
# define clock and period
create_clock -period 7.000 -name clk_pin -waveform {0.000 3.5000} [get_ports clk]


# Global timing constraints
set_input_delay -clock clk_pin 0.000      [get_ports reset]
set_input_delay -clock clk_pin -min 1.200 [get_ports reset]
set_input_delay -clock clk_pin 0.000      [get_ports wr]
set_input_delay -clock clk_pin -min 1.200 [get_ports wr]
set_input_delay -clock clk_pin 0.000      [get_ports oe]
set_input_delay -clock clk_pin -min 1.200 [get_ports oe]
set_input_delay -clock clk_pin 0.000      [get_ports f0]
set_input_delay -clock clk_pin -min 1.200 [get_ports f0]
set_input_delay -clock clk_pin 0.000      [get_ports f1]
set_input_delay -clock clk_pin -min 1.200 [get_ports f1]
set_input_delay -clock clk_pin 0.000      [get_ports f2]
set_input_delay -clock clk_pin -min 1.200 [get_ports f2]
set_input_delay -clock clk_pin 0.000      [get_ports f3]
set_input_delay -clock clk_pin -min 1.200 [get_ports f3]
set_input_delay -clock clk_pin 0.000      [get_ports f4]
set_input_delay -clock clk_pin -min 1.200 [get_ports f4]
set_input_delay -clock clk_pin 0.000      [get_ports f5]
set_input_delay -clock clk_pin -min 1.200 [get_ports f5]
set_input_delay -clock clk_pin 0.000      [get_ports f6]
set_input_delay -clock clk_pin -min 1.200 [get_ports f6]
set_input_delay -clock clk_pin 0.000      [get_ports f7]
set_input_delay -clock clk_pin -min 1.200 [get_ports f7]
#set_output_delay -clock clk_pin 0.000    [all_outputs]
set_output_delay -clock clk_pin 0.000     [all_outputs]
# Path specific timing constraints
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports F0]
set_output_delay -clock clk_pin -min 1.200                   [get_ports F0]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports F1]
set_output_delay -clock clk_pin -min 1.200                   [get_ports F1]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports F2]
set_output_delay -clock clk_pin -min 1.200                   [get_ports F2]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports F3]
set_output_delay -clock clk_pin -min 1.200                   [get_ports F3]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports F4]
set_output_delay -clock clk_pin -min 1.200                   [get_ports F4]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports F5]
set_output_delay -clock clk_pin -min 1.200                   [get_ports F5]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports F6]
set_output_delay -clock clk_pin -min 1.200                   [get_ports F6]
set_output_delay -clock clk_pin -clock_fall -add_delay 0.000 [get_ports F7]
set_output_delay -clock clk_pin -min 1.200                   [get_ports F7]